# Завдання: порахуйте кількість літер строки. Строка та літера
#           даються на вхід користувачем. В залежності від кількости
#           виведіть на екран поясненя: строка містить літеру "с" до
#           10 разів, строка містить літеру "с" до 20 разid, строка містить
#           символ "c" більше 20 разів. Проінформуйте користувача якщо
#           введено більше ніж одну літеру (літера має довжину більше 1)
#           або повідомляти якщо такої літери взагалі не знайдено.
#
# Підказка:
# * input() - ввод від користувача
# * len(str) - довжина строки
# * str.count(letter) - підрахунок елементів (літер) letter
# * if - elif - else - для логіки виводу на екран
#
# Приклад:
#
# Введіть текст: Це якийсь рандомний текст
# Введіть літеру: й
# Строка містить літеру "й" до 10 разів.
#
# Введіть текст: аааааааааааааааааааааааа
# Введіть літеру: а
# Строка містить літеру "а" більше 20 разів.

input_string = input('Введіть текст: ')
input_latter = input('Введіть літеру: ')

if len(input_latter) > 1:
    print('Літера має довжину більше 1')

elif len(input_latter) == 0:
    print('Ви не ввели лiтеру')

else:
    if 10 > input_string.count(input_latter) >= 1:
        print(f'Строка містить літеру "{input_latter}" до 10 разів.')

    elif 20 > input_string.count(input_latter) >= 10:
        print(f'Строка містить літеру "{input_latter}" до 20 разів.')

    elif input_string.count(input_latter) >= 20:
        print(f'Строка містить літеру "{input_latter}" більше 20 разів.')

    else:
        print(f'Строка не містить літеру "{input_latter}".')